todo/app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "completed", "updated_at", "due_date") VALUES('ToDo List App', '2010-06-13 14:20:42', NULL, '2010-06-13 14:20:42', '2010-06-20')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |wants|
      if @project.save

UPDATE "projects" SET "updated_at" = '2010-06-13 19:22:46', "name" = 'Sustainable Industries' WHERE "id" = 4
---
  def update
    respond_to do |wants|
      if @project.update_attributes(params[:project])

DELETE FROM "projects" WHERE "id" = 4
---
  def destroy
    @project.destroy

SELECT * FROM "projects" WHERE ("projects"."id" = 2)
SELECT * FROM "tasks" WHERE ("tasks".project_id = 2)
UPDATE "projects" SET "updated_at" = '2010-06-13 16:54:56', "completed" = 't' WHERE "id" = 2
UPDATE "tasks" SET "updated_at" = '2010-06-13 16:58:44', "completed" = 't' WHERE "id" = 14
---
  def complete
    @project = Project.find(params[:id])

    @tasks = @project.tasks
    @tasks.each do |task|
      task.update_attributes(:completed => !@project.completed)

SELECT * FROM "projects" WHERE ("projects"."id" = 4)
---
    def find_project
      @project = Project.find(params[:id])