todo/app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all(:order => "priority DESC")
---
SELECT * FROM "tasks" ORDER BY priority DESC

  def today
    @tasks = Task.find_all_by_today(true)
---
SELECT * FROM "tasks" WHERE ("tasks"."today" = 't') LIMIT 1

  def new
    @task = Task.new

    @projects = Project.all
---
SELECT * FROM "projects"

  def edit
    @task = Task.find(params[:id])

    @projects = Project.all
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
SELECT * FROM "projects"

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "created_at", "today", "completed", "notes", "updated_at", "project_id", "priority", "due_date") VALUES('Fix Project select input', '2010-06-13 16:08:14', NULL, 'f', '', '2010-06-13 16:08:14', 1, 4, '2010-06-13')

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
UPDATE "tasks" SET "updated_at" = '2010-06-10 04:40:46', "name" = 'Complete a task', "due_date" = '2010-06-10' WHERE "id" = 5

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 4)
DELETE FROM "tasks" WHERE "id" = 4

  def complete
    @task = Task.find(params[:id])

    @task.update_attributes(:completed => !@task.completed)

    @task.project.update_attributes(:completed => false) if !@task.completed and @task.project.completed
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 2)
UPDATE "tasks" SET "updated_at" = '2010-06-10 03:57:38', "completed" = 't' WHERE "id" = 2
UPDATE "projects" SET "updated_at" = '2010-06-13 18:39:43', "completed" = 't' WHERE "id" = 1

  def do_today
    @task = Task.find(params[:id])
    @task.update_attributes(:today => !@task.today, :completed => false)
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 10)
UPDATE "tasks" SET "updated_at" = '2010-06-13 18:04:56', "completed" = 'f', "today" = 't' WHERE "id" = 6

  def clear_completed
    @tasks = Task.find(:all, :conditions => { :completed => true })

    @tasks.each do |task|
      task.destroy
---
SELECT * FROM "tasks" WHERE ("tasks"."completed" = 't')
DELETE FROM "tasks" WHERE "id" = 1