todo/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2010-06-15 04:01:32', 'f56baf45d4d8500b50d41ffcb8351c25ff1d4e6cd178dccd16f9f768099a4dcadd88d255cc15d6ec90cd78d03298f942676d5782e7702e455049583911afa6b3', '2010-06-15 04:01:32', 'yale', 'kAuLKJU8gk88WPuREWrm', '62e5641eeff17b97057c0b23393c17469464608521dc7eae90187b2b638706d1a00e553aa8e349578a288c96a8471405c5131a8db2dd9292055d391365c1f6fd', 'yale@brandeis.edu')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

UPDATE "users" SET "persistence_token" = '3674a2b74b894979c66bac10071b3ae19bde5d1f044e67ff1a696961b2ada2672e32022b79d2e80f65f7c764661c8a3496484595da00154fbc1927d97cab9b79', "updated_at" = '2010-06-15 04:33:01', "password_salt" = 'IUDmtHn5uAM4HQKoHJkV', "crypted_password" = '5edb7ea2bf455ceb09c69ad5b7a74c51422edf109e7c8a8b179363a0d4d0246b1c188c704a8bba4b20ffa07e9e15db5905a2f6ff9b17c3ecbe724a30726b5670' WHERE "id" = 1
---
  def update
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])